app/controllers/api/restaurants_controller.rb

    def search
        search = params[:search]
        # debugger
        if search.is_a?(Object)
            @restaurants = Restaurant
                            .where(name: search["0"])
                            .or(Restaurant.where(city: search["1"]))
        else
            @restaurants = Restaurant.where(
                            'city ILIKE :search
                            OR name ILIKE :search',
                            {search: "%#{search}"})
---
SELECT "restaurants".* FROM "restaurants" WHERE ("restaurants"."name" IN ($1, $2, $3) OR "restaurants"."city" = $4)  [["name", "Crosby"], ["name", "Chef Yang"], ["name", "Cucina 355"], ["city", "Clifton"]]
SELECT "restaurants".* FROM "restaurants" WHERE (city ILIKE '%mon'